; domain
(define (domain freecell2_4-domain)
 (:requirements :strips :typing)
 (:types card suitsort denomination)
 (:predicates (on ?c1 - card ?c2 - card) (incell ?c - card) (clear ?c - card) (cellspace ?n - denomination) (colspace ?n - denomination) (home ?c - card) (bottomcol ?c - card) (canstack ?c1 - card ?c2 - card) (suit ?c - card ?s - suitsort) (value ?c - card ?v - denomination) (successor ?n1 - denomination ?n0 - denomination))
 (:action move
  :parameters ( ?card - card ?oldcard - card ?newcard - card)
  :precondition (and (clear ?card) (clear ?newcard) (canstack ?card ?newcard) (on ?card ?oldcard))
  :effect (and (on ?card ?newcard) (clear ?oldcard) (not (on ?card ?oldcard)) (not (clear ?newcard))))
 (:action move_b
  :parameters ( ?card - card ?newcard - card ?cols - denomination ?ncols - denomination)
  :precondition (and (clear ?card) (bottomcol ?card) (clear ?newcard) (canstack ?card ?newcard) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (on ?card ?newcard) (colspace ?ncols) (not (bottomcol ?card)) (not (clear ?newcard)) (not (colspace ?cols))))
 (:action sendtofree
  :parameters ( ?card - card ?oldcard - card ?cells - denomination ?ncells - denomination)
  :precondition (and (clear ?card) (on ?card ?oldcard) (cellspace ?cells) (successor ?cells ?ncells))
  :effect (and (incell ?card) (clear ?oldcard) (cellspace ?ncells) (not (on ?card ?oldcard)) (not (clear ?card)) (not (cellspace ?cells))))
 (:action sendtofree_b
  :parameters ( ?card - card ?cells - denomination ?ncells - denomination ?cols - denomination ?ncols - denomination)
  :precondition (and (clear ?card) (bottomcol ?card) (cellspace ?cells) (successor ?cells ?ncells) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (incell ?card) (colspace ?ncols) (cellspace ?ncells) (not (bottomcol ?card)) (not (clear ?card)) (not (colspace ?cols)) (not (cellspace ?cells))))
 (:action sendtonewcol
  :parameters ( ?card - card ?oldcard - card ?cols - denomination ?ncols - denomination)
  :precondition (and (clear ?card) (colspace ?cols) (successor ?cols ?ncols) (on ?card ?oldcard))
  :effect (and (bottomcol ?card) (clear ?oldcard) (colspace ?ncols) (not (on ?card ?oldcard)) (not (colspace ?cols))))
 (:action sendtohome
  :parameters ( ?card - card ?oldcard - card ?suit - suitsort ?vcard - denomination ?homecard - card ?vhomecard - denomination)
  :precondition (and (clear ?card) (on ?card ?oldcard) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard))
  :effect (and (home ?card) (clear ?oldcard) (not (on ?card ?oldcard)) (not (home ?homecard)) (not (clear ?card))))
 (:action sendtohome_b
  :parameters ( ?card - card ?suit - suitsort ?vcard - denomination ?homecard - card ?vhomecard - denomination ?cols - denomination ?ncols - denomination)
  :precondition (and (clear ?card) (bottomcol ?card) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (home ?card) (colspace ?ncols) (not (home ?homecard)) (not (clear ?card)) (not (bottomcol ?card)) (not (colspace ?cols))))
 (:action homefromfreecell
  :parameters ( ?card - card ?suit - suitsort ?vcard - denomination ?homecard - card ?vhomecard - denomination ?cells - denomination ?ncells - denomination)
  :precondition (and (incell ?card) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard) (cellspace ?cells) (successor ?ncells ?cells))
  :effect (and (home ?card) (cellspace ?ncells) (not (incell ?card)) (not (cellspace ?cells)) (not (home ?homecard))))
 (:action colfromfreecell
  :parameters ( ?card - card ?newcard - card ?cells - denomination ?ncells - denomination)
  :precondition (and (incell ?card) (clear ?newcard) (canstack ?card ?newcard) (cellspace ?cells) (successor ?ncells ?cells))
  :effect (and (cellspace ?ncells) (clear ?card) (on ?card ?newcard) (not (incell ?card)) (not (cellspace ?cells)) (not (clear ?newcard))))
 (:action newcolfromfreecell
  :parameters ( ?card - card ?cols - denomination ?ncols - denomination ?cells - denomination ?ncells - denomination)
  :precondition (and (incell ?card) (colspace ?cols) (cellspace ?cells) (successor ?cols ?ncols) (successor ?ncells ?cells))
  :effect (and (bottomcol ?card) (clear ?card) (colspace ?ncols) (cellspace ?ncells) (not (incell ?card)) (not (colspace ?cols)) (not (cellspace ?cells))))
)

; problem
(define (problem freecell2_4-problem)
 (:domain freecell2_4-domain)
 (:objects
   spadea diamonda club2 heart2 spade2 hearta diamond2 cluba diamond0 club0 heart0 spade0 - card
   diamond club heart spade - suitsort
   n0 n1 n2 n3 n4 - denomination
 )
 (:init (successor n1 n0) (successor n2 n1) (successor n3 n2) (successor n4 n3) (cellspace n2) (clear spadea) (on spadea spade2) (bottomcol spade2) (clear diamonda) (on diamonda hearta) (bottomcol hearta) (clear club2) (on club2 diamond2) (bottomcol diamond2) (clear heart2) (on heart2 cluba) (bottomcol cluba) (colspace n0) (value spadea n1) (suit spadea spade) (canstack spadea diamond2) (canstack spadea heart2) (value diamonda n1) (suit diamonda diamond) (canstack diamonda club2) (canstack diamonda spade2) (value club2 n2) (suit club2 club) (value heart2 n2) (suit heart2 heart) (value spade2 n2) (suit spade2 spade) (value hearta n1) (suit hearta heart) (canstack hearta club2) (canstack hearta spade2) (value diamond2 n2) (suit diamond2 diamond) (value cluba n1) (suit cluba club) (canstack cluba diamond2) (canstack cluba heart2) (home diamond0) (value diamond0 n0) (suit diamond0 diamond) (home club0) (value club0 n0) (suit club0 club) (home heart0) (value heart0 n0) (suit heart0 heart) (home spade0) (value spade0 n0) (suit spade0 spade))
 (:goal (and (home diamond2) (home club2) (home heart2) (home spade2)))
)

; plan
1. (sendtohome spadea spade2 spade n1 spade0 n0)
   deleted: (on spadea spade2) (home spade0) (clear spadea)
   added: (home spadea) (clear spade2)
   goals met: 0 of 4
2. (sendtohome diamonda hearta diamond n1 diamond0 n0)
   deleted: (on diamonda hearta) (home diamond0) (clear diamonda)
   added: (home diamonda) (clear hearta)
   goals met: 0 of 4
3. (sendtohome_b hearta heart n1 heart0 n0 n0 n1)
   deleted: (home heart0) (clear hearta) (bottomcol hearta) (colspace n0)
   added: (home hearta) (colspace n1)
   goals met: 0 of 4
4. (sendtohome_b spade2 spade n2 spadea n1 n1 n2)
   deleted: (home spadea) (clear spade2) (bottomcol spade2) (colspace n1)
   added: (home spade2) (colspace n2)
   goals met: 1 of 4
5. (sendtohome heart2 cluba heart n2 hearta n1)
   deleted: (on heart2 cluba) (home hearta) (clear heart2)
   added: (home heart2) (clear cluba)
   goals met: 2 of 4
6. (sendtohome_b cluba club n1 club0 n0 n2 n3)
   deleted: (home club0) (clear cluba) (bottomcol cluba) (colspace n2)
   added: (home cluba) (colspace n3)
   goals met: 2 of 4
7. (sendtohome club2 diamond2 club n2 cluba n1)
   deleted: (on club2 diamond2) (home cluba) (clear club2)
   added: (home club2) (clear diamond2)
   goals met: 3 of 4
8. (sendtohome_b diamond2 diamond n2 diamonda n1 n3 n4)
   deleted: (home diamonda) (clear diamond2) (bottomcol diamond2) (colspace n3)
   added: (home diamond2) (colspace n4)
   goals met: 4 of 4
